INSERT INTO Theaters ("name",city, address) VALUES 
	('МХТ им. Чехова', 'Москва', 'Камергерский пер., 3'),
	('Театр наций', 'Москва', 'Петровский пер., 3'),
	('Большой театр', 'Москва', 'Театральная пл., 1');
	
INSERT INTO Concert_halls ("name",theater_id,size_of_array,type_of_seats) VALUES 
	('Новая сцена',3,6,
	 ARRAY['{"Название":"Партер","Секция":null,"Ряды":14,
	  "Места":[32,32,26,26,26,26,26,26,26,24,22,20,16,8],"Сторона":null}',
	  '{"Название":"Амфитеатр","Секция":null,"Ряды":3,
	  "Места":[48,40,44],"Сторона":null}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":3,
	  "Места":[31,32,34],"Сторона":"Левая"}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":3,
	  "Места":[31,32,34],"Сторона":"Правая"}',
	  '{"Название":"Первый ярус","Секция":null,"Ряды":5,
	  "Места":[31,31,24,22,16],"Сторона":"Левая"}',
	  '{"Название":"Первый ярус","Секция":null,"Ряды":5,
	  "Места":[31,31,24,22,16],"Сторона":"Правая"}']::jsonb[]);
	  
	  
INSERT INTO Theaters ("name",city, address) VALUES 
	('МХТ им. Чехова', 'Москва', 'Камергерский пер., 3'),
	('Театр наций', 'Москва', 'Петровский пер., 3'),
	('Большой театр', 'Москва', 'Театральная пл., 1');
	
INSERT INTO Concert_halls ("name",theater_id,size_of_array,type_of_seats) VALUES 
	('Новая сцена',3,6,
	 ARRAY['{"Название":"Партер","Секция":null,"Ряды":14,
	  "Места":[32,32,26,26,26,26,26,26,26,24,22,20,16,8],"Сторона":null}',
	  '{"Название":"Амфитеатр","Секция":null,"Ряды":3,
	  "Места":[48,40,44],"Сторона":null}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":3,
	  "Места":[31,32,34],"Сторона":"Левая"}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":3,
	  "Места":[31,32,34],"Сторона":"Правая"}',
	  '{"Название":"Первый ярус","Секция":null,"Ряды":5,
	  "Места":[31,31,24,22,16],"Сторона":"Левая"}',
	  '{"Название":"Первый ярус","Секция":null,"Ряды":5,
	  "Места":[31,31,24,22,16],"Сторона":"Правая"}']::jsonb[]);

INSERT INTO Concert_halls ("name",theater_id,size_of_array,type_of_seats) VALUES 
	('Большой зал',1,6,
	 ARRAY['{"Название":"Партер","Секция":null,"Ряды":18,
	  "Места":[20,20,20,20,20,20,20,22,22,22,22,22,22,22,22,20,20,20],"Сторона":null}',
	  '{"Название":"Амфитеатр","Секция":null,"Ряды":5,
	  "Места":[9,18,22,25,28],"Сторона":null}',
	  '{"Название":"Ложа бенуар","Секция":null,"Ряды":1,
	  "Места":[22],"Сторона":"Правая"}',
	  '{"Название":"Ложа бенуар","Секция":null,"Ряды":1,
	  "Места":[22],"Сторона":"Левая"}',  
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":7,
	  "Места":[13,12,13,14,4,4,6],"Сторона":null}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":6,
	  "Места":[6,6,7,7,5,3],"Сторона":"Левая"}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":6,
	  "Места":[6,6,7,7,5,3],"Сторона":"Правая"}',
	  '{"Название":"Бель-этаж","Секция":null,"Ряды":3,
	  "Места":[31,32,34],"Сторона":"Правая"}',
	  '{"Название":"Первый ярус","Секция":null,"Ряды":5,
	  "Места":[31,31,24,22,16],"Сторона":"Левая"}',
	  '{"Название":"Первый ярус","Секция":null,"Ряды":5,
	  "Места":[31,31,24,22,16],"Сторона":"Правая"}']::jsonb[]);
	
	
	('Главный зал',1,NULL),
	('Главный зал',2,NULL);
